---
title: AdvancedTransparent
classe: Autodesk.Revit.DB.Visual.AdvancedTransparent
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# AdvancedTransparent

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String SurfaceAlbedo { get; }` | `AdvancedTransparent.SurfaceAlbedo` | String |
| `String SurfaceAnisotropy { get; }` | `AdvancedTransparent.SurfaceAnisotropy` | String |
| `String SurfaceCutout { get; }` | `AdvancedTransparent.SurfaceCutout` | String |
| `String SurfaceNdfType { get; }` | `AdvancedTransparent.SurfaceNdfType` | String |
| `String SurfaceNormal { get; }` | `AdvancedTransparent.SurfaceNormal` | String |
| `String SurfaceRotation { get; }` | `AdvancedTransparent.SurfaceRotation` | String |
| `String SurfaceRoughness { get; }` | `AdvancedTransparent.SurfaceRoughness` | String |
| `String TransparentColor { get; }` | `AdvancedTransparent.TransparentColor` | String |
| `String TransparentDistance { get; }` | `AdvancedTransparent.TransparentDistance` | String |
| `String TransparentIor { get; }` | `AdvancedTransparent.TransparentIor` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```